package com.arxyt.colonypathingedition.core.costants.states;

/**
 * 此状态表用于处理牧户的DECIDE状态转移，让牧户的畜牧处理更有条理，而不是过于依赖随机数。
 */
public enum HerderCheckState {

    /**
     * 首先检查是否有可以繁育的动物，繁育过后直到状态重置将忽视这一选项，仅在后台计数繁育冷却时间。
     */
    CHECK_BREED,

    /**
     * 然后检查是否有需要喂养的动物，喂养过后也会忽视此选项，直到状态重置，此状态下仅喂养小动物，取消对大动物的喂食。
     */
    CHECK_BABY,

    /**
     * 此状态仅调整屠杀策略，其余无区别，此状态可能一直触发，直到屠杀判定失败。
     */
    CHECK_BUTCHER,

    /**
     * 实际上只有初值以及每次重新开始工作时为此状态，在状态转移中不会出现，具体表现为开工前检查一下栏内掉落物，并调整至其会紧挨屠杀失败出现，以方便捡拾掉落物。
     */
    CHECK_PICKUP
}
